; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-5-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-3 - location
	p1-2 - location
	p2-0 - location
	p2-4 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s0)
	(at driver3 s4)
	(at driver4 s0)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s1)
	(at package2 s3)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(link s0 s3)
	(link s3 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s4)
	(link s4 s3)
	(link s4 s2)
	(link s2 s4)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s1)
	(at driver4 s1)
	(at truck1 s3)
	(at truck3 s4)
	(at truck4 s1)
	(at truck5 s2)
	(at package1 s3)
	(at package2 s1)
	))


)

; plan
1. (walk driver4 s0 p0-3)
   deleted: (at driver4 s0)
   added: (at driver4 p0-3)
   goals met: 0 of 9
2. (walk driver4 p0-3 s3)
   deleted: (at driver4 p0-3)
   added: (at driver4 s3)
   goals met: 0 of 9
3. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 0 of 9
4. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   goals met: 0 of 9
5. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 0 of 9
6. (drive-truck truck3 s3 s1 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   goals met: 0 of 9
7. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   goals met: 1 of 9
8. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   goals met: 1 of 9
9. (drive-truck truck3 s1 s3 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 1 of 9
10. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   goals met: 2 of 9
11. (drive-truck truck3 s3 s4 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 3 of 9
12. (disembark-truck driver1 truck3 s4)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 3 of 9
13. (board-truck driver4 truck5 s3)
   deleted: (at driver4 s3) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 3 of 9
14. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 3 of 9
15. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 9
16. (drive-truck truck1 s4 s3 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 4 of 9
17. (drive-truck truck4 s4 s1 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 5 of 9
18. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 6 of 9
19. (drive-truck truck5 s3 s2 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 7 of 9
20. (disembark-truck driver4 truck5 s2)
   deleted: (driving driver4 truck5)
   added: (at driver4 s2) (empty truck5)
   goals met: 7 of 9
21. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 8 of 9
22. (walk driver4 s2 p1-2)
   deleted: (at driver4 s2)
   added: (at driver4 p1-2)
   goals met: 8 of 9
23. (walk driver4 p1-2 s1)
   deleted: (at driver4 p1-2)
   added: (at driver4 s1)
   goals met: 9 of 9
